# CLI
brew "fish"
brew "fisher"
brew "fd"      # File search (required by fzf plugin)
brew "ripgrep" # Line search
brew "fzf"     # Fuzzy finder - https://github.com/junegunn/fzf
brew "xh"      # Friendly curl - https://github.com/ducaale/xh
brew "thefuck" # Autocorrection
brew "tldr"    # Man
brew "eza"     # ls - https://eza.rocks
brew "bat"     # cat - https://github.com/sharkdp/bat
brew "dasel"   # jq/yq and more - https://github.com/tomwright/dasel

# Development
brew "git"
brew "git-delta" # https://dandavison.github.io/delta/
brew "gnupg"

# Admin
brew "tmux"
brew "nvim"
brew "mosh"
brew "htop"
brew "mc"
brew "dog" # better dig - https://github.com/ogham/dog

# Ruby
brew "ruby-install"
brew "chruby-fish"

# Node
brew "fnm"

# Postgres
brew "postgresql"
brew "pgcli" # https://github.com/dbcli/pgcli
brew "pspg"

# Redis
brew "redis"
brew "iredis" # https://github.com/laixintao/iredis
