# CLI
brew "zsh"
brew "zim"
brew "ripgrep" # Search
brew "fzf"     # Fuzzy finder - https://github.com/junegunn/fzf
brew "xh"      # Friendly curl - https://github.com/ducaale/xh
brew "thefuck" # Autocorrection
brew "tldr"    # Man
brew "exa"     # ls - https://github.com/ogham/exa
brew "bat"     # cat - https://github.com/sharkdp/bat
brew "dasel"   # jq/yq and more - https://github.com/tomwright/dasel

# Development
brew "git"
brew "git-delta" # https://dandavison.github.io/delta/
brew "gnupg"

# Admin
brew "tmux"
brew "smug" # tmux manager - https://github.com/ivaaaan/smug
brew "nvim"
brew "mosh"
brew "htop"
brew "mc"
brew "dog" # better dig - https://github.com/ogham/dog

# Ruby
brew "ruby-install"
brew "chruby"

# Node
brew "fnm"

# Postgres
brew "postgresql"
brew "pgcli" # https://github.com/dbcli/pgcli
brew "pspg"

# Redis
brew "redis"
brew "iredis" # https://github.com/laixintao/iredis
